use lazy_regex::{regex, Regex};
use lazy_static::lazy_static;

use crate::definition::{
    碼表格式, 觸鍵方式, 輸入方案定義, 轉寫法定義, 邊界判定規則, 鍵位定義
};
use crate::gear::layout::{
    上檔盤面, 基本盤面, 大寫字母盤面, 盤面定義, 盤面選擇碼, 配列, 鍵盤佈局, 鍵面刻印,
};
use crate::gear::theory::輸入方案環境;
use crate::key_code::KeyCode;
use crate::spelling_algebra::拼寫運算;
use crate::{盤面, 變換, 鍵面};

macro_rules! 鍵位 {
    ($輸入碼: ident => $鍵碼: path) => {
        鍵位定義 {
            輸入碼: stringify!($輸入碼),
            盤面: 盤面選擇碼(0),
            鍵碼: $鍵碼,
        }
    };
}

const 並擊鍵序: &[鍵位定義] = &[
    鍵位!(人 => KeyCode::Q),
    鍵位!(心 => KeyCode::W),
    鍵位!(手 => KeyCode::E),
    鍵位!(口 => KeyCode::R),
    鍵位!(卜 => KeyCode::T),
    鍵位!(金 => KeyCode::A),
    鍵位!(木 => KeyCode::S),
    鍵位!(水 => KeyCode::D),
    鍵位!(火 => KeyCode::F),
    鍵位!(土 => KeyCode::G),
    鍵位!(竹 => KeyCode::Z),
    鍵位!(戈 => KeyCode::X),
    鍵位!(中 => KeyCode::C),
    鍵位!(一 => KeyCode::V),
    鍵位!(弓 => KeyCode::B),
    鍵位!(从 => KeyCode::P),
    鍵位!(比 => KeyCode::O),
    鍵位!(抙 => KeyCode::I),
    鍵位!(吕 => KeyCode::U),
    鍵位!(卞 => KeyCode::Y),
    鍵位!(鍂 => KeyCode::Semicolon),
    鍵位!(林 => KeyCode::L),
    鍵位!(沝 => KeyCode::K),
    鍵位!(炎 => KeyCode::J),
    鍵位!(圭 => KeyCode::H),
    鍵位!(竺 => KeyCode::Slash),
    鍵位!(戔 => KeyCode::Dot),
    鍵位!(串 => KeyCode::Comma),
    鍵位!(二 => KeyCode::M),
    鍵位!(弜 => KeyCode::N),
];

lazy_static! {
    static ref 並擊碼表示: Box<[拼寫運算::<'static>]> = Box::new([
        變換!("^([金木水火土竹戈中一弓人心手口卜]+)([鍂林沝炎圭竺戔串二弜从比抙吕卞]+)$", "${1}·${2}"),
        // 右天七曜
        變換!("鍂", "金"),
        變換!("林", "木"),
        變換!("沝", "水"),
        變換!("炎", "火"),
        變換!("圭", "土"),

        變換!("竺", "竹"),
        變換!("戔", "戈"),
        變換!("串", "中"),
        變換!("二", "一"),
        變換!("弜", "弓"),

        變換!("从", "人"),
        變換!("比", "心"),
        變換!("抙", "手"),
        變換!("吕", "口"),
        變換!("卞", "卜"),

        // 難字
        變換!("木水火", "難"),
        // 六代字根
        變換!("心手口", "止"),
        變換!("戈中一", "片"),
        // 哲理類
        變換!("水火", "日"),
        變換!("金木", "月"),
        // 筆劃類
        變換!("中一", "十"),
        變換!("竹戈", "大"),
        // 人體類
        // 字形類
        變換!("人心", "尸"),
        變換!("心手", "廿"),
        變換!("木水", "山"),
        變換!("戈中", "女"),
        變換!("手口", "田"),
    ]);

    static ref 並擊碼鍵位: Box<[拼寫運算::<'static>]> = Box::new([
        // 哲理類
        變換!("日", "水火"),
        變換!("月", "金木"),
        // 筆劃類
        變換!("十", "中一"),
        變換!("大", "竹戈"),
        // 人體類
        // 字形類
        變換!("尸", "人心"),
        變換!("廿", "心手"),
        變換!("山", "木水"),
        變換!("女", "戈中"),
        變換!("田", "手口"),
        // 難字
        變換!("難", "木水火"),
        // 六代字根
        變換!("止", "心手口"),
        變換!("片", "戈中一"),

        // 右天七曜
        變換!("(·.*)金", "${1}鍂"),
        變換!("(·.*)木", "${1}林"),
        變換!("(·.*)水", "${1}沝"),
        變換!("(·.*)火", "${1}炎"),
        變換!("(·.*)土", "${1}圭"),

        變換!("(·.*)竹", "${1}竺"),
        變換!("(·.*)戈", "${1}戔"),
        變換!("(·.*)中", "${1}串"),
        變換!("(·.*)一", "${1}二"),
        變換!("(·.*)弓", "${1}弜"),

        變換!("(·.*)人", "${1}从"),
        變換!("(·.*)心", "${1}比"),
        變換!("(·.*)手", "${1}抙"),
        變換!("(·.*)口", "${1}吕"),
        變換!("(·.*)卜", "${1}卞"),

        變換!("·", ""),
    ]);

    static ref 並擊轉倉頡碼: Box<[拼寫運算::<'static>]> = Box::new([
        變換!("·", ""),
    ]);

    static ref 倉頡碼轉並擊: Box<[拼寫運算<'static>]> = Box::new([
        // 只取首尾
        變換!("^(.).*(.)$", "${1}·${2}"),
    ]);

    static ref 驗證倉頡碼: Box<[&'static Regex]> =
        Box::new([regex!("^([日月金木水火土竹戈十大中一弓人心手口尸廿山女田卜難止片])+$").deref(),]);
}

const 七曜並擊盤面: 盤面定義<'static> = 盤面! {
    [ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ],
    [ {中:人, 上:_, 下:_, 左:_, 右:尸} {中:心, 上:_, 下:_, 左:尸, 右:廿} {中:手, 上:_, 下:_, 左:廿, 右:田} {中:口, 上:_, 下:_, 左:田, 右:_} {中:卜, 上:_, 下:_, 左:_, 右:_}
      {中:卜, 上:_, 下:_, 左:_, 右:_} {中:口, 上:_, 下:_, 左:_, 右:田} {中:手, 上:_, 下:_, 左:田, 右:廿} {中:心, 上:_, 下:_, 左:廿, 右:尸} {中:人, 上:_, 下:_, 左:尸, 右:_} _ _ ],
    [ {中:金, 上:_, 下:_, 左:_, 右:月} {中:木, 上:_, 下:_, 左:月, 右:山} {中:水, 上:_, 下:_, 左:山, 右:日} {中:火, 上:_, 下:_, 左:日, 右:_} {中:土, 上:_, 下:_, 左:_, 右:_}
      {中:土, 上:_, 下:_, 左:_, 右:_} {中:火, 上:_, 下:_, 左:_, 右:日} {中:水, 上:_, 下:_, 左:日, 右:山} {中:木, 上:_, 下:_, 左:山, 右:月} {中:金, 上:_, 下:_, 左:月, 右:_} _ _ ],
    [ {中:竹, 上:_, 下:_, 左:_, 右:大} {中:戈, 上:_, 下:_, 左:大, 右:女} {中:中, 上:_, 下:_, 左:女, 右:十} {中:一, 上:_, 下:_, 左:十, 右:_} {中:弓, 上:_, 下:_, 左:_, 右:_}
      {中:弓, 上:_, 下:_, 左:_, 右:_} {中:一, 上:_, 下:_, 左:_, 右:十} {中:中, 上:_, 下:_, 左:十, 右:女} {中:戈, 上:_, 下:_, 左:女, 右:大} {中:竹, 上:_, 下:_, 左:大, 右:_} ],
    [ _ _ _ ]
};

const 倉頡七曜並擊佈局: 鍵盤佈局 = 鍵盤佈局 {
    盤面: &[基本盤面, 上檔盤面, 大寫字母盤面, 七曜並擊盤面],
    默認盤面: 盤面選擇碼(4),
    首選配列: 配列::直列分體,
};

pub fn 倉頡七曜並擊輸入方案(_環境: 輸入方案環境) -> 輸入方案定義<'static> {
    輸入方案定義 {
        名稱: "倉頡七曜並擊",
        佈局: &倉頡七曜並擊佈局,
        指法: 觸鍵方式::並擊,
        編碼法: 碼表格式::並擊,
        字根表: 並擊鍵序,
        轉寫法: 轉寫法定義 {
            輸入碼表示: &並擊碼表示,
            輸入碼鍵位: &並擊碼鍵位,
            拼式轉寫規則: &並擊轉倉頡碼,
            字根拆分規則: &倉頡碼轉並擊,
            拼式驗證規則: &驗證倉頡碼,
            邊界判定: 邊界判定規則 {
                分隔鍵: &[],
                起始鍵: &[],
                終止鍵: &[],
            },
        },
        動態切換: &[],
    }
}
