use lazy_regex::regex;
use lazy_static::lazy_static;

use crate::definition::{ 击键方式, 转写定义, 输入方案定义, 键位映射定义 };
use crate::gear::layout::{ 基本盘面, 上档盘面, 大写字母盘面 };
use crate::gear::layout::{ 键面刻印, 盘面定义, 盘面序号, 键盘布局, 键盘配列 };
use crate::key_code::KeyCode;
use crate::spelling_algebra::拼写运算;
use crate::{ 键面, 盘面 };
use crate::变换;
use crate::键位映射;

const 粤语拼音盘面: 盘面定义<'static> =
    盘面![
    [ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ],
    [ 空 {中:清, 上:_, 下:_, 左:_, 右:以} {中:来, 上:_, 下:_, 左:以, 右:泥} {中:端, 上:_, 下:_, 左:泥, 右:_} 透 科 {中:孤, 上:_, 下:_, 左:_, 右:高} {中:修, 上:_, 下:_, 左:高, 右:宾} {中:毕, 上:_, 下:_, 左:宾, 右:_} 空 _ _ ],
    [ 空 {中:心, 上:_, 下:_, 左:_, 右:云} {中:晓, 上:_, 下:_, 左:云, 右:疑} {中:见, 上:_, 下:_, 左:疑, 右:_} 溪 遮 {中:师, 上:_, 下:_, 左:_, 右:几} {中:威, 上:_, 下:_, 左:几, 右:登} {中:德, 上:_, 下:_, 左:登, 右:_} 空 _ ],
    [ 空 {中:精, 上:_, 下:_, 左:_, 右:亚} {中:非, 上:_, 下:_, 左:亚, 右:明} {中:帮, 上:_, 下:_, 左:明, 右:_} 滂 靴 诸 {中:吾, 上:_, 下:_, 左:_, 右:金} {中:急, 上:_, 下:_, 左:金, 右:_} 空 ],
    [ 家 _ 家 ]
];

const 粤语并击布局: 键盘布局 = 键盘布局 {
    盘面: &[基本盘面, 上档盘面, 大写字母盘面, 粤语拼音盘面],
    默认盘面: 盘面序号(4),
    默认配列: 键盘配列::正交直列,
};

const 并击键位映射: &[键位映射定义] = &[
    键位映射!(心 => KeyCode::S),
    键位映射!(清 => KeyCode::W),
    键位映射!(精 => KeyCode::X),
    键位映射!(晓 => KeyCode::D),
    键位映射!(来 => KeyCode::E),
    键位映射!(非 => KeyCode::C),
    键位映射!(见 => KeyCode::F),
    键位映射!(端 => KeyCode::R),
    键位映射!(帮 => KeyCode::V),
    键位映射!(溪 => KeyCode::G),
    键位映射!(透 => KeyCode::T),
    键位映射!(滂 => KeyCode::B),
    键位映射!(家 => KeyCode::Space),
    键位映射!(遮 => KeyCode::H),
    键位映射!(科 => KeyCode::Y),
    键位映射!(靴 => KeyCode::N),
    键位映射!(师 => KeyCode::J),
    键位映射!(孤 => KeyCode::U),
    键位映射!(诸 => KeyCode::M),
    键位映射!(威 => KeyCode::K),
    键位映射!(修 => KeyCode::I),
    键位映射!(吾 => KeyCode::Comma),
    键位映射!(德 => KeyCode::L),
    键位映射!(毕 => KeyCode::O),
    键位映射!(急 => KeyCode::Dot),
];

lazy_static! {
    static ref 并击码表示: Box<[拼写运算<'static>]> = Box::new([
        变换!("非帮", "明"),
        变换!("来端", "泥"),
        变换!("晓见", "我"),
        变换!("心见", "古"),
        变换!("心溪", "困"),
        变换!("心晓", "云"),
        变换!("清来", "以"),
        变换!("精非", "亚"),
        变换!("^([家遮科靴登宾金德毕急威修])", "亚$1"),
        变换!("^([师诸])", "以$1"),
        变换!("^([孤])", "云$1"),
        变换!("修毕", "宾"),
        变换!("威德", "登"),
        变换!("吾急", "金"),
        变换!("师宾", "先"),
        变换!("师毕", "屑"),
        变换!("师威", "几"),
        变换!("孤登", "东"),
        变换!("孤德", "笃"),
        变换!("师登", "英"),
        变换!("师德", "益"),
        变换!("遮登", "郑"),
        变换!("遮德", "石"),
        变换!("靴登", "张"),
        变换!("靴德", "着"),
        变换!("科登", "刚"),
        变换!("科德", "角"),
        变换!("师修", "朝"),
        变换!("孤修", "高"),
        变换!("诸宾", "鸳"),
        变换!("诸毕", "乙"),
        变换!("家威", "皆"),
        变换!("家修", "交"),
        变换!("科威", "栽"),
        变换!("师金", "兼"),
        变换!("师急", "劫"),
        变换!("靴宾", "津"),
        变换!("靴毕", "卒"),
        变换!("靴威", "虽"),
        变换!("家金", "缄"),
        变换!("家急", "甲"),
        变换!("家宾", "翻"),
        变换!("家毕", "发"),
        变换!("孤宾", "官"),
        变换!("孤毕", "括"),
        变换!("孤威", "魁"),
        变换!("科宾", "干"),
        变换!("科毕", "割"),
        变换!("科金", "甘"),
        变换!("科急", "蛤"),
        变换!("家登", "彭"),
        变换!("家德", "额"),
    ]);

    static ref 并击码键位: Box<[拼写运算<'static>]> = Box::new([
        变换!("明", "非帮"),
        变换!("泥", "来端"),
        变换!("我", "晓见"),
        变换!("古", "心见"),
        变换!("困", "心溪"),
        变换!("先", "师宾"),
        变换!("屑", "师毕"),
        变换!("几", "师威"),
        变换!("东", "孤登"),
        变换!("笃", "孤德"),
        变换!("英", "师登"),
        变换!("益", "师德"),
        变换!("郑", "遮登"),
        变换!("石", "遮德"),
        变换!("张", "靴登"),
        变换!("着", "靴德"),
        变换!("刚", "科登"),
        变换!("角", "科德"),
        变换!("朝", "师修"),
        变换!("高", "孤修"),
        变换!("鸳", "诸宾"),
        变换!("乙", "诸毕"),
        变换!("皆", "家威"),
        变换!("交", "家修"),
        变换!("栽", "科威"),
        变换!("兼", "师金"),
        变换!("劫", "师急"),
        变换!("津", "靴宾"),
        变换!("卒", "靴毕"),
        变换!("虽", "靴威"),
        变换!("缄", "家金"),
        变换!("甲", "家急"),
        变换!("翻", "家宾"),
        变换!("发", "家毕"),
        变换!("官", "孤宾"),
        变换!("括", "孤毕"),
        变换!("魁", "孤威"),
        变换!("干", "科宾"),
        变换!("割", "科毕"),
        变换!("甘", "科金"),
        变换!("蛤", "科急"),
        变换!("彭", "家登"),
        变换!("额", "家德"),
        变换!("亚([遮科靴登宾金德毕急威修])", "$1"),
        变换!("以([师诸])", "$1"),
        变换!("云([孤])", "$1"),
        变换!("亚", "精非"),
        变换!("以", "清来"),
        变换!("云", "心晓"),
        变换!("宾", "修毕"),
        变换!("登", "威德"),
        变换!("金", "吾急"),
    ]);
}

pub fn 输入方案() -> 输入方案定义<'static> {
    输入方案定义 {
        名称: "粤语",
        布局: &粤语并击布局,
        指法: 击键方式::并击,
        键位映射: 并击键位映射,
        转写: 转写定义 {
            编码预览: &并击码表示,
            键位提示: &并击码键位,
            输入棱镜: &[],
            词库棱镜: &[],
            拼式验证规则: &[],
        },
    }
}
