use lazy_regex::{regex, Regex};
use lazy_static::lazy_static;

use crate::definition::{
    碼表格式, 觸鍵方式, 輸入方案定義, 轉寫法定義, 邊界判定規則, 鍵位定義
};
use crate::gear::layout::{
    上檔盤面, 基本盤面, 大寫字母盤面, 盤面定義, 盤面選擇碼, 配列, 鍵盤佈局, 鍵面刻印,
};
use crate::gear::theory::輸入方案環境;
use crate::key_code::KeyCode;
use crate::spelling_algebra::拼寫運算;
use crate::{盤面, 變換, 轉寫, 鍵面};

macro_rules! 鍵位 {
    ($輸入碼: ident => $鍵碼: path) => {
        鍵位定義 {
            輸入碼: stringify!($輸入碼),
            盤面: 盤面選擇碼(0),
            鍵碼: $鍵碼,
        }
    };
}

const 並擊鍵序: &[鍵位定義] = &[
    鍵位!(ㄙ => KeyCode::S),
    鍵位!(ㄘ => KeyCode::W),
    鍵位!(ㄗ => KeyCode::X),
    鍵位!(ㄏ => KeyCode::D),
    鍵位!(ㄌ => KeyCode::E),
    鍵位!(ㄈ => KeyCode::C),
    鍵位!(ㄍ => KeyCode::F),
    鍵位!(ㄉ => KeyCode::R),
    鍵位!(ㄅ => KeyCode::V),
    鍵位!(ㄎ => KeyCode::G),
    鍵位!(ㄊ => KeyCode::T),
    鍵位!(ㄆ => KeyCode::B),
    鍵位!(ㄧ => KeyCode::J),
    鍵位!(ㄨ => KeyCode::U),
    鍵位!(ㄩ => KeyCode::M),
    鍵位!(ㄚ => KeyCode::Space),
    鍵位!(ㄣ => KeyCode::K),
    鍵位!(ㄦ => KeyCode::I),
    鍵位!(ㄜ => KeyCode::L),
    鍵位!(ㄛ => KeyCode::O),
];

lazy_static! {
    static ref 並擊注音表示: Box<[拼寫運算::<'static>]> = Box::new([
        // 並擊聲母
        變換!("^ㄗㄈ", "ㄓ"),
        變換!("^ㄘㄌ", "ㄔ"),
        變換!("^ㄙㄏ", "ㄕ"),
        變換!("^ㄏㄍ", "ㄖ"),
        變換!("^ㄈㄅ", "ㄇ"),
        變換!("^ㄌㄉ", "ㄋ"),
        // 特殊配列鍵盤用
        變換!("^ㄗㄅ", "ㄆ"),
        變換!("^ㄘㄉ", "ㄊ"),
        變換!("^ㄙㄍ", "ㄎ"),

        // G,K,H 接 I/Ü 作 ⟨ji/ju, qi/qu, xi/xu⟩
        // 若分尖團，也可用 Z,C,S 與 I/Ü 相拼
        變換!("^[ㄍㄗ](ㄧ|ㄩ)", "ㄐ$1"),
        變換!("^[ㄎㄘ](ㄧ|ㄩ)", "ㄑ$1"),
        變換!("^[ㄏㄙ](ㄧ|ㄩ)", "ㄒ$1"),

        // 舌尖元音⟨ï⟩
        變換!("^(ㄓㄔㄕㄖㄗㄘㄙ)ㄦ?$", "${1}"),

        變換!("ㄚㄣㄜ$", "ㄤ"),
        變換!("ㄣㄜ$", "ㄥ"),
        變換!("ㄨㄚㄦㄛ$", "ㄨㄤ"),
        變換!("ㄨㄦㄛ$", "ㄨㄥ"),

        變換!("ㄚㄣ$", "ㄢ"),

        變換!("ㄧㄦ$", "ㄧㄡ"),
        變換!("ㄨㄦ$", "ㄨㄟ"),
        變換!("ㄚㄛ$", "ㄠ"),
        變換!("ㄦㄛ$", "ㄡ"),
        變換!("ㄚㄦ$", "ㄞ"),
        變換!("ㄦㄜ?$", "ㄟ"),
        變換!("ㄚㄜ$", "ㄚ"),
        變換!("ㄧㄜ$", "ㄧㄝ"),
        變換!("ㄩㄜ$", "ㄩㄝ"),
    ]);

    static ref 並擊注音鍵位: Box<[拼寫運算<'static>]> = Box::new([
        // 缺省韻母
        變換!("^([ㄅㄆㄈ])ㄨ$", "${1}"),
        變換!("^([ㄇ])ㄜ$", "${1}"),
        變換!("^([ㄉㄊㄋㄌ])ㄜ$", "${1}"),
        變換!("^([ㄍㄎㄏ])ㄜ$", "${1}"),
        // 韻母的省略
        變換!("^([ㄅㄆㄇㄈㄉㄊㄋㄌㄍㄎㄏ])ㄟ", "${1}ㄦ"),
        // 並擊聲母
        變換!("ㄓ", "ㄗㄈ"),
        變換!("ㄔ", "ㄘㄌ"),
        變換!("ㄕ", "ㄙㄏ"),
        變換!("ㄖ", "ㄏㄍ"),
        變換!("ㄇ", "ㄈㄅ"),
        變換!("ㄋ", "ㄌㄉ"),
        轉寫!("ㄐㄑㄒ", "ㄍㄎㄏ"),

        變換!("ㄨㄤ", "ㄨㄚㄦㄛ"),
        變換!("ㄨㄥ", "ㄨㄦㄛ"),
        變換!("ㄤ", "ㄚㄣㄜ"),
        變換!("ㄥ", "ㄣㄜ"),

        變換!("ㄢ", "ㄚㄣ"),

        變換!("ㄧㄡ", "ㄧㄦ"),
        變換!("ㄨㄟ", "ㄨㄦ"),
        變換!("ㄠ", "ㄚㄛ"),
        變換!("ㄡ", "ㄦㄛ"),
        變換!("ㄞ", "ㄚㄦ"),
        變換!("ㄟ", "ㄦㄜ"),
        變換!("^ㄚ$", "ㄚㄜ"),
        變換!("ㄝ", "ㄜ"),
    ]);

    static ref 注音轉拼音: Box<[拼寫運算::<'static>]> = Box::new([
        變換!("ㄓ", "zh"),
        變換!("ㄔ", "ch"),
        變換!("ㄕ", "sh"),
        變換!("ㄞ", "ai"),
        變換!("ㄟ", "ei"),
        變換!("ㄠ", "ao"),
        變換!("ㄡ", "ou"),
        變換!("ㄢ", "an"),
        變換!("ㄧㄣ", "in"),
        變換!("ㄩㄣ", "ün"),
        變換!("ㄣ", "en"),
        變換!("ㄤ", "ang"),
        變換!("ㄧㄥ", "ing"),
        變換!("ㄨㄥ", "ong"),
        變換!("ㄩㄥ", "iong"),
        變換!("ㄥ", "eng"),
        變換!("ㄦ", "er"),
        變換!("([ㄧㄩ])ㄝ", "${1}e"),
        變換!("ㄝ", "eh"),
        轉寫!("ㄅㄆㄇㄈㄉㄊㄋㄌㄍㄎㄏㄐㄑㄒㄖㄗㄘㄙㄧㄨㄩㄚㄛㄜ", "bpmfdtnlgkhjqxrzcsiuüaoe"),

        // 漢語拼音方案的拼寫規則
        變換!("^i(ng?)$", "yi$1"),
        變換!("^i$", "yi"),
        變換!("^i", "y"),
        變換!("^ong$", "weng"),
        變換!("^u$", "wu"),
        變換!("^u", "w"),
        變換!("^ü", "yu"),
        變換!("^([jqx])ü", "${1}u"),
        // 一些容錯
        變換!("^([bpmf])uo$", "${1}o"),
        變換!("^([nl])uei$", "${1}ei"),
        變換!("^([nl])iong$", "${1}ong"),
        變換!("^([zcsr]h?)i([aoe])", "$1$2"),
        變換!("^([zcsr]h?)i(ng?)$", "${1}e$2"),
        // 拼寫規則
        變換!("iou$", "iu"),
        變換!("uei$", "ui"),
        變換!("uen$", "un"),
        變換!("^([zcsr]h?)$", "${1}i"),

        // 聲母獨用時補足缺省韻母
        // ⟨bu, pu, fu⟩
        變換!("^([bpf])$", "${1}u"),
        // ⟨de, te, ne, le, ge, ke, he⟩
        // 特別地，⟨me⟩ 對應常用字「麼·么」
        變換!("^([mdtnlgkh])$", "${1}e"),
    ]);

    static ref 拼音轉注音: Box<[拼寫運算<'static>]> = Box::new([
        變換!("iu", "iou"),
        變換!("ui", "uei"),
        變換!("ong", "ung"),
        變換!("^yi?", "i"),
        變換!("^wu?", "u"),
        變換!("iu", "ü"),
        變換!("^([jqx])u", "${1}ü"),
        變換!("([iuü])n", "${1}en"),
        變換!("^zhi?", "ㄓ"),
        變換!("^chi?", "ㄔ"),
        變換!("^shi?", "ㄕ"),
        變換!("^([zcsr])i", "${1}"),
        變換!("ai", "ㄞ"),
        變換!("ei", "ㄟ"),
        變換!("ao", "ㄠ"),
        變換!("ou", "ㄡ"),
        變換!("ang", "ㄤ"),
        變換!("eng", "ㄥ"),
        變換!("an", "ㄢ"),
        變換!("en", "ㄣ"),
        變換!("er", "ㄦ"),
        變換!("eh", "ㄝ"),
        變換!("([iü])e", "${1}ㄝ"),
        轉寫!("bpmfdtnlgkhjqxrzcsiuüaoe", "ㄅㄆㄇㄈㄉㄊㄋㄌㄍㄎㄏㄐㄑㄒㄖㄗㄘㄙㄧㄨㄩㄚㄛㄜ"),
    ]);

    static ref 貌似拼音: Box<[&'static Regex]> = Box::new([
        regex!("^([bpm])([iu]|a|i?e|o|[ae]i|i?ao|[oi]u|i?an|[ie]n|[ei]ng|ang|ong)$").deref(),
        regex!("^([fw])(u|a|o|[ae]i|ao|ou|an|en|eng|ang|ong)$").deref(),
        regex!("^([dt])([iu]|i?a|i?e|uo|[aeu]i|i?ao|[oi]u|[iu]?an|[ue]n|[ei]ng|ang|ong)$").deref(),
        regex!(
            "^([nl])([iuv]|i?a|[iuv]?e|üe?|u?o|[aeu]i|i?ao|[oi]u|[iu]?an|[iue]n|[ei]ng|i?ang|i?ong)$"
        ).deref(),
        regex!("^([gkh])(u|u?a|e|uo|u?ai|[ue]i|ao|ou|u?an|[ue]n|eng|u?ang|ong)$").deref(),
        regex!("^([zcs]h?|r)([iu]|u?a|e|uo|u?ai|[ue]i|ao|ou|u?an|[ue]n|eng|u?ang|ong)$").deref(),
        regex!("^([jqxy])([iu]|i?a|[iu]?e|o|i?ao|[oi]u|[iu]?an|[iu]n|ing|i?ang|i?ong)$").deref(),
        // 尖音，演示指法用。其中韻母 i 雙寫
        regex!("^([zcs])(ii|[iv]e?|üe?|i?ao|iu|[iv]a?n|üa?n|ia?ng|iong)$").deref(),
        regex!("^([aeo]|[ae]i|ao|ou|[ae]ng?|er)$").deref(),
        // 聲母
        regex!("^([bpmfdtnlgkhjqxr]|[zcs]h?)-?$").deref(),
        // 非音節形式的韻母
        regex!("^([yw])-?$").deref(),
        regex!("^-?([iuv]|[iu]?[ao]|[iuv]?e|üe?|u?[ae]i|ui|i?ao|i?ou|iu|[iuv]?an|üa?n|[iuv]n|u?en|[iu]?ang|ing|u?eng|i?ong)?$").deref(),
    ]);
}

const 宮保注音盤面: 盤面定義<'static> = 盤面![
    [ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ],
    [ 空 {中:ㄘ, 上:_, 下:_, 左:_, 右:"ㄔ"} {中:ㄌ, 上:_, 下:_, 左:"ㄔ", 右:"ㄋ"} {中:ㄉ, 上:_, 下:_, 左:"ㄋ", 右:_} ㄊ 空 ㄨ {中:ㄦ, 上:"ㄞ", 下:_, 左:"ㄟ", 右:"ㄡ"} {中:ㄛ, 上:"ㄠ", 下:_, 左:"ㄡ", 右:_} 空 _ _ ],
    [ 空 {中:ㄙ, 上:_, 下:_, 左:_, 右:"ㄕ"} {中:ㄏ, 上:"ㄒ", 下:_, 左:"ㄕ", 右:"ㄖ"} {中:ㄍ, 上:"ㄐ", 下:_, 左:"ㄖ", 右:_} {中:ㄎ, 上:"ㄑ", 下:_, 左:_, 右:_} 空 ㄧ {中:ㄣ, 上:"ㄢ", 下:"ㄤ", 左:_, 右:"ㄥ"} {中:ㄜ, 上:_, 下:"ㄤ", 左:"ㄥ", 右:"ㄝ"} _ _ _ ],
    [ 空 {中:ㄗ, 上:_, 下:_, 左:_, 右:"ㄓ"} {中:ㄈ, 上:_, 下:_, 左:"ㄓ", 右:"ㄇ"} {中:ㄅ, 上:_, 下:_, 左:"ㄇ", 右:_} ㄆ 空 ㄩ _ _ _ ],
    [ ㄚ _ ㄚ ]
];

const 宮保注音鍵盤佈局: 鍵盤佈局 = 鍵盤佈局 {
    盤面: &[基本盤面, 上檔盤面, 大寫字母盤面, 宮保注音盤面],
    默認盤面: 盤面選擇碼(4),
    首選配列: 配列::正交直列,
};

pub fn 宮保注音輸入方案(_環境: 輸入方案環境) -> 輸入方案定義<'static> {
    輸入方案定義 {
        名稱: "宮保注音",
        佈局: &宮保注音鍵盤佈局,
        指法: 觸鍵方式::並擊,
        編碼法: 碼表格式::並擊,
        字根表: 並擊鍵序,
        轉寫法: 轉寫法定義 {
            輸入碼表示: &並擊注音表示,
            輸入碼鍵位: &並擊注音鍵位,
            拼式轉寫規則: &注音轉拼音,
            字根拆分規則: &拼音轉注音,
            拼式驗證規則: &貌似拼音,
            邊界判定: 邊界判定規則 {
                分隔鍵: &[],
                起始鍵: &[],
                終止鍵: &[],
            },
        },
        動態切換: &[],
    }
}
