use lazy_regex::regex;
use lazy_static::lazy_static;

use crate::definition::{ 击键方式, 转写定义, 输入方案定义, 键位映射定义 };
use crate::gear::layout::{ 上档盘面, 基本盘面, 大写字母盘面 };
use crate::gear::layout::{ 盘面定义, 盘面序号, 键盘布局, 键盘配列, 键面刻印 };
use crate::key_code::KeyCode;
use crate::spelling_algebra::拼写运算;
use crate::{ 盘面, 键面 };
use crate::变换;
use crate::键位映射;

const 早期中古汉语拼音盘面: 盘面定义<'static> =
    盘面![
    [ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ],
    [ 清 來 定 端 透 空 流 臻 遇 上 _ _ ],
    [ 心 曉 羣 見 溪 空 止 曾 假 入 _ ],
    [ 精 匣 並 幫 滂 空 空 深 空 去 ],
    [ 果 _ 果 ]
];

const 早期中古汉语并击布局: 键盘布局 = 键盘布局 {
    盘面: &[基本盘面, 上档盘面, 大写字母盘面, 早期中古汉语拼音盘面],
    默认盘面: 盘面序号(4),
    默认配列: 键盘配列::正交直列,
};

const 并击键位映射: &[键位映射定义] = &[
    键位映射!(心 => KeyCode::A),
    键位映射!(清 => KeyCode::Q),
    键位映射!(精 => KeyCode::Z),
    键位映射!(曉 => KeyCode::S),
    键位映射!(來 => KeyCode::W),
    键位映射!(匣 => KeyCode::X),
    键位映射!(羣 => KeyCode::D),
    键位映射!(定 => KeyCode::E),
    键位映射!(並 => KeyCode::C),
    键位映射!(見 => KeyCode::F),
    键位映射!(端 => KeyCode::R),
    键位映射!(幫 => KeyCode::V),
    键位映射!(溪 => KeyCode::G),
    键位映射!(透 => KeyCode::T),
    键位映射!(滂 => KeyCode::B),
    键位映射!(果 => KeyCode::Space),
    键位映射!(止 => KeyCode::J),
    键位映射!(流 => KeyCode::U),
    键位映射!(假 => KeyCode::L),
    键位映射!(遇 => KeyCode::O),
    键位映射!(曾 => KeyCode::K),
    键位映射!(臻 => KeyCode::I),
    键位映射!(深 => KeyCode::Comma),
    键位映射!(入 => KeyCode::Semicolon),
    键位映射!(上 => KeyCode::P),
    键位映射!(去 => KeyCode::Slash),
];

lazy_static! {
    static ref 并击码表示: Box<[拼写运算<'static>]> = Box::new([
        变换!("精匣", "莊"),
        变换!("清來定", "崇"),
        变换!("清來", "初"),
        变换!("心曉羣", "俟"),
        变换!("心曉", "生"),
        变换!("精幫", "章"),
        变换!("清定端", "常"),
        变换!("清端", "昌"),
        变换!("心羣見", "船"),
        变换!("心見", "書"),
        变换!("清定", "從"),
        变换!("心羣", "邪"),
        变换!("並幫", "明"),
        变换!("來定端", "娘"),
        变换!("定端", "泥"),
        变换!("來端", "知"),
        变换!("來透", "徹"),
        变换!("來定", "澄"),
        变换!("曉羣見", "日"),
        变换!("羣見", "疑"),
        变换!("曉羣", "云"),
        变换!("心定", "以"),
        变换!("^([果止流假遇曾臻深上去入])", "影$1"),
        变换!("果止", "蟹"),
        变换!("果流", "效"),
        变换!("果深", "咸"),
        变换!("果臻", "山"),
        变换!("果曾", "宕"),
        变换!("遇曾", "江"),
        变换!("止曾", "梗"),
        变换!("流曾", "通"),
    ]);
    static ref 并击码键位: Box<[拼写运算<'static>]> = Box::new([
        变换!("莊", "精匣"),
        变换!("崇", "清來定"),
        变换!("初", "清來"),
        变换!("俟", "心曉羣"),
        变换!("生", "心曉"),
        变换!("章", "精幫"),
        变换!("常", "清定端"),
        变换!("昌", "清端"),
        变换!("船", "心羣見"),
        变换!("書", "心見"),
        变换!("從", "清定"),
        变换!("邪", "心羣"),
        变换!("明", "並幫"),
        变换!("娘", "來定端"),
        变换!("泥", "定端"),
        变换!("知", "來端"),
        变换!("徹", "來透"),
        变换!("澄", "來定"),
        变换!("日", "曉羣見"),
        变换!("疑", "羣見"),
        变换!("云", "曉羣"),
        变换!("以", "心定"),
        变换!("影", ""),
        变换!("蟹", "果止"),
        变换!("效", "果流"),
        变换!("咸", "果深"),
        变换!("山", "果臻"),
        变换!("宕", "果曾"),
        变换!("江", "遇曾"),
        变换!("梗", "止曾"),
        变换!("通", "流曾"),
    ]);
}

pub fn 输入方案() -> 输入方案定义<'static> {
    输入方案定义 {
        名称: "早期中古汉语",
        布局: &早期中古汉语并击布局,
        指法: 击键方式::并击,
        键位映射: 并击键位映射,
        转写: 转写定义 {
            编码预览: &并击码表示,
            键位提示: &并击码键位,
            输入棱镜: &[],
            词库棱镜: &[],
            拼式验证规则: &[],
        },
    }
}
