use lazy_regex::regex;
use lazy_static::lazy_static;

use crate::definition::{ 击键方式, 转写定义, 输入方案定义, 键位映射定义 };
use crate::gear::layout::{ 上档盘面, 基本盘面, 大写字母盘面 };
use crate::gear::layout::{ 盘面定义, 盘面序号, 键盘布局, 键盘配列, 键面刻印 };
use crate::key_code::KeyCode;
use crate::spelling_algebra::拼写运算;
use crate::{ 盘面, 键面 };
use crate::变换;
use crate::键位映射;

const 晚期中古汉语拼音盘面: 盘面定义<'static> =
    盘面![
    [ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ],
    [ 空 清 來 端 透 空 流 臻 遇 上 _ _ ],
    [ 氣 心 曉 見 溪 空 止 曾 假 入 _ ],
    [ 空 精 非 幫 滂 空 空 深 空 去 ],
    [ 果 _ 果 ]
];

const 晚期中古汉语并击布局: 键盘布局 = 键盘布局 {
    盘面: &[基本盘面, 上档盘面, 大写字母盘面, 晚期中古汉语拼音盘面],
    默认盘面: 盘面序号(4),
    默认配列: 键盘配列::正交直列,
};

const 并击键位映射: &[键位映射定义] = &[
    键位映射!(心 => KeyCode::S),
    键位映射!(清 => KeyCode::W),
    键位映射!(精 => KeyCode::X),
    键位映射!(曉 => KeyCode::D),
    键位映射!(來 => KeyCode::E),
    键位映射!(非 => KeyCode::C),
    键位映射!(見 => KeyCode::F),
    键位映射!(端 => KeyCode::R),
    键位映射!(幫 => KeyCode::V),
    键位映射!(溪 => KeyCode::G),
    键位映射!(透 => KeyCode::T),
    键位映射!(滂 => KeyCode::B),
    键位映射!(氣 => KeyCode::A),
    键位映射!(果 => KeyCode::Space),
    键位映射!(止 => KeyCode::J),
    键位映射!(流 => KeyCode::U),
    键位映射!(假 => KeyCode::L),
    键位映射!(遇 => KeyCode::O),
    键位映射!(曾 => KeyCode::K),
    键位映射!(臻 => KeyCode::I),
    键位映射!(深 => KeyCode::Comma),
    键位映射!(入 => KeyCode::Semicolon),
    键位映射!(上 => KeyCode::P),
    键位映射!(去 => KeyCode::Slash),
];

lazy_static! {
    static ref 并击码表示: Box<[拼写运算<'static>]> = Box::new([
        变换!("幫氣", "並"),
        变换!("精非幫", "微"),
        变换!("非幫", "明"),
        变换!("非滂", "敷"),
        变换!("非氣", "奉"),
        变换!("端氣", "定"),
        变换!("清來端", "娘"),
        变换!("來端", "泥"),
        变换!("清端", "知"),
        变换!("清透氣", "澄"),
        变换!("清透", "徹"),
        变换!("清氣", "從"),
        变换!("心氣", "邪"),
        变换!("精非", "照"),
        变换!("清來氣", "牀"),
        变换!("清來", "穿"),
        变换!("心曉見", "日"),
        变换!("心曉氣", "禪"),
        变换!("心曉", "審"),
        变换!("見氣", "羣"),
        变换!("曉見", "疑"),
        变换!("曉氣", "匣"),
        变换!("來氣", "喻"),
        变换!("^([果止流假遇曾臻深上去入])", "影$1"),
        变换!("果止", "蟹"),
        变换!("果流", "效"),
        变换!("果深", "咸"),
        变换!("果臻", "山"),
        变换!("果曾", "宕"),
        变换!("遇曾", "江"),
        变换!("止曾", "梗"),
        变换!("流曾", "通"),
    ]);
    static ref 并击码键位: Box<[拼写运算<'static>]> = Box::new([
        变换!("並", "幫氣"),
        变换!("微", "精非幫"),
        变换!("明", "非幫"),
        变换!("敷", "非滂"),
        变换!("奉", "非氣"),
        变换!("定", "端氣"),
        变换!("娘", "清來端"),
        变换!("泥", "來端"),
        变换!("知", "清端"),
        变换!("澄", "清透氣"),
        变换!("徹", "清透"),
        变换!("從", "清氣"),
        变换!("邪", "心氣"),
        变换!("照", "精非"),
        变换!("牀", "清來氣"),
        变换!("穿", "清來"),
        变换!("日", "心曉見"),
        变换!("禪", "心曉氣"),
        变换!("審", "心曉"),
        变换!("羣", "見氣"),
        变换!("疑", "曉見"),
        变换!("匣", "曉氣"),
        变换!("喻", "來氣"),
        变换!("影", ""),
        变换!("蟹", "果止"),
        变换!("效", "果流"),
        变换!("咸", "果深"),
        变换!("山", "果臻"),
        变换!("宕", "果曾"),
        变换!("江", "遇曾"),
        变换!("梗", "止曾"),
        变换!("通", "流曾"),
    ]);
}

pub fn 输入方案() -> 输入方案定义<'static> {
    输入方案定义 {
        名称: "晚期中古汉语",
        布局: &晚期中古汉语并击布局,
        指法: 击键方式::并击,
        键位映射: 并击键位映射,
        转写: 转写定义 {
            编码预览: &并击码表示,
            键位提示: &并击码键位,
            输入棱镜: &[],
            词库棱镜: &[],
            拼式验证规则: &[],
        },
    }
}
