use lazy_regex::regex;
use lazy_static::lazy_static;

use crate::definition::{ 击键方式, 转写定义, 输入方案定义, 键位映射定义 };
use crate::gear::layout::{ 上档盘面, 基本盘面, 大写字母盘面 };
use crate::gear::layout::{ 盘面定义, 盘面序号, 键盘布局, 键盘配列, 键面刻印 };
use crate::key_code::KeyCode;
use crate::spelling_algebra::拼写运算;
use crate::{ 变换, 转写 };
use crate::{ 盘面, 键面 };
use crate::键位映射;

const 现代汉语拼音盘面: 盘面定义<'static> =
    盘面![
    [ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ],
    [ 空 清 來 端 透 空 模 支 波 空 _ _ ],
    [ 空 心 曉 見 溪 空 齊 痕 歌 空 _ ],
    [ 空 精 非 幫 滂 空 魚 空 空 空 ],
    [ 麻 _ 麻 ]
];

const 现代汉语并击布局: 键盘布局 = 键盘布局 {
    盘面: &[基本盘面, 上档盘面, 大写字母盘面, 现代汉语拼音盘面],
    默认盘面: 盘面序号(4),
    默认配列: 键盘配列::正交直列,
};

const 并击键位映射: &[键位映射定义] = &[
    键位映射!(心 => KeyCode::S),
    键位映射!(清 => KeyCode::W),
    键位映射!(精 => KeyCode::X),
    键位映射!(曉 => KeyCode::D),
    键位映射!(來 => KeyCode::E),
    键位映射!(非 => KeyCode::C),
    键位映射!(見 => KeyCode::F),
    键位映射!(端 => KeyCode::R),
    键位映射!(幫 => KeyCode::V),
    键位映射!(溪 => KeyCode::G),
    键位映射!(透 => KeyCode::T),
    键位映射!(滂 => KeyCode::B),
    键位映射!(齊 => KeyCode::J),
    键位映射!(模 => KeyCode::U),
    键位映射!(魚 => KeyCode::M),
    键位映射!(麻 => KeyCode::Space),
    键位映射!(痕 => KeyCode::K),
    键位映射!(支 => KeyCode::I),
    键位映射!(歌 => KeyCode::L),
    键位映射!(波 => KeyCode::O),
];

lazy_static! {
    static ref 并击码表示: Box<[拼写运算<'static>]> = Box::new([
        变换!("非幫", "明"),
        变换!("來端", "泥"),
        变换!("精非", "照"),
        变换!("清來", "穿"),
        变换!("心曉", "審"),
        变换!("曉見", "日"),
        变换!("^([齊模魚麻痕支歌波])", "影$1"),
        变换!("([齊魚])歌", "${1}皆"),
        变换!("模麻支波", "唐合"),
        变换!("麻痕歌", "唐"),
        变换!("痕歌", "庚"),
        变换!("齊支波", "東齊"),
        变换!("模支波", "東"),
        变换!("麻痕", "寒"),
        变换!("麻支", "開"),
        变换!("模支$", "微合"),
        变换!("支歌", "微"),
        变换!("麻波", "豪"),
        变换!("齊支$", "侯齊"),
        变换!("支波", "侯"),
        变换!("影支$", "影兒"),
        变换!("齊(.+)$", "${1}齊"),
        变换!("模(.+)$", "${1}合"),
        变换!("魚(.+)$", "${1}撮"),
        变换!("^([精清心照穿審日])$", "$1支"),
    ]);
    static ref 并击码键位: Box<[拼写运算<'static>]> = Box::new([
        变换!("^([精清心照穿審日])支$", "$1"),
        变换!("明", "非幫"),
        变换!("泥", "來端"),
        变换!("照", "精非"),
        变换!("穿", "清來"),
        变换!("審", "心曉"),
        变换!("日", "曉見"),
        变换!("影", ""),
        变换!("唐合", "模麻支波"),
        变换!("唐", "麻痕歌"),
        变换!("庚", "痕歌"),
        变换!("東齊", "齊支波"),
        变换!("東", "模支波"),
        变换!("寒", "麻痕"),
        变换!("開", "麻支"),
        变换!("微合", "模支"),
        变换!("微", "支歌"),
        变换!("豪", "麻波"),
        变换!("侯齊", "齊支"),
        变换!("侯", "支波"),
        转写!("兒皆", "支歌"),
        变换!("([麻痕支歌波]+)齊$", "齊$1"),
        变换!("([麻痕支歌波]+)合$", "模$1"),
        变换!("([麻痕支歌波]+)撮$", "魚$1"),
    ]);
}

pub fn 输入方案() -> 输入方案定义<'static> {
    输入方案定义 {
        名称: "现代汉语",
        布局: &现代汉语并击布局,
        指法: 击键方式::并击,
        键位映射: 并击键位映射,
        转写: 转写定义 {
            编码预览: &并击码表示,
            键位提示: &并击码键位,
            输入棱镜: &[],
            词库棱镜: &[],
            拼式验证规则: &[],
        },
    }
}
