use lazy_regex::regex;
use lazy_static::lazy_static;

use crate::definition::{ 击键方式, 转写定义, 输入方案定义, 键位映射定义 };
use crate::gear::layout::{ 上档盘面, 基本盘面, 大写字母盘面 };
use crate::gear::layout::{ 盘面定义, 盘面序号, 键盘布局, 键盘配列, 键面刻印 };
use crate::key_code::KeyCode;
use crate::spelling_algebra::拼写运算;
use crate::{ 盘面, 键面 };
use crate::变换;
use crate::键位映射;

const 近古汉语拼音盘面: 盘面定义<'static> =
    盘面![
    [ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ],
    [ 空 清 來 端 透 空 魚 真 歌 空 _ _ ],
    [ 空 心 曉 見 溪 空 齊 庚 車 空 _ ],
    [ 空 精 非 幫 滂 空 支 侵 空 空 ],
    [ 家 _ 家 ]
];

const 近古汉语并击布局: 键盘布局 = 键盘布局 {
    盘面: &[基本盘面, 上档盘面, 大写字母盘面, 近古汉语拼音盘面],
    默认盘面: 盘面序号(4),
    默认配列: 键盘配列::正交直列,
};

const 并击键位映射: &[键位映射定义] = &[
    键位映射!(心 => KeyCode::S),
    键位映射!(清 => KeyCode::W),
    键位映射!(精 => KeyCode::X),
    键位映射!(曉 => KeyCode::D),
    键位映射!(來 => KeyCode::E),
    键位映射!(非 => KeyCode::C),
    键位映射!(見 => KeyCode::F),
    键位映射!(端 => KeyCode::R),
    键位映射!(幫 => KeyCode::V),
    键位映射!(溪 => KeyCode::G),
    键位映射!(透 => KeyCode::T),
    键位映射!(滂 => KeyCode::B),
    键位映射!(家 => KeyCode::Space),
    键位映射!(齊 => KeyCode::J),
    键位映射!(魚 => KeyCode::U),
    键位映射!(支 => KeyCode::M),
    键位映射!(車 => KeyCode::L),
    键位映射!(歌 => KeyCode::O),
    键位映射!(庚 => KeyCode::K),
    键位映射!(真 => KeyCode::I),
    键位映射!(侵 => KeyCode::Comma),
];

lazy_static! {
    static ref 并击码表示: Box<[拼写运算<'static>]> = Box::new([
        变换!("精非幫", "微"),
        变换!("非幫", "明"),
        变换!("來端", "泥"),
        变换!("心曉見", "日"),
        变换!("曉見", "疑"),
        变换!("精非", "照"),
        变换!("清來", "穿"),
        变换!("心曉", "審"),
        变换!("^([家齊魚支庚真侵車歌])", "影$1"),
        变换!("魚庚", "東"),
        变换!("家庚", "江"),
        变换!("家真", "寒"),
        变换!("車真", "先"),
        变换!("歌真", "桓"),
        变换!("車侵", "廉"),
        变换!("家侵", "監"),
        变换!("家齊", "皆"),
        变换!("家魚", "蕭"),
        变换!("魚歌", "尤"),
    ]);
    static ref 并击码键位: Box<[拼写运算<'static>]> = Box::new([
        变换!("微", "精非幫"),
        变换!("明", "非幫"),
        变换!("泥", "來端"),
        变换!("疑", "曉見"),
        变换!("照", "精非"),
        变换!("穿", "清來"),
        变换!("日", "心曉見"),
        变换!("審", "心曉"),
        变换!("影", ""),
        变换!("東", "魚庚"),
        变换!("江", "家庚"),
        变换!("寒", "家真"),
        变换!("先", "車真"),
        变换!("桓", "歌真"),
        变换!("廉", "車侵"),
        变换!("監", "家侵"),
        变换!("皆", "家齊"),
        变换!("蕭", "家魚"),
        变换!("尤", "魚歌"),
    ]);
}

pub fn 输入方案() -> 输入方案定义<'static> {
    输入方案定义 {
        名称: "近古汉语",
        布局: &近古汉语并击布局,
        指法: 击键方式::并击,
        键位映射: 并击键位映射,
        转写: 转写定义 {
            编码预览: &并击码表示,
            键位提示: &并击码键位,
            输入棱镜: &[],
            词库棱镜: &[],
            拼式验证规则: &[],
        },
    }
}
