use lazy_regex::regex;
use lazy_static::lazy_static;

use crate::definition::{ 击键方式, 转写定义, 输入方案定义, 键位映射定义 };
use crate::gear::layout::{ 上档盘面, 基本盘面, 大写字母盘面 };
use crate::gear::layout::{ 盘面定义, 盘面序号, 键盘布局, 键盘配列, 键面刻印 };
use crate::key_code::KeyCode;
use crate::spelling_algebra::拼写运算;
use crate::{ 盘面, 键面 };
use crate::变换;
use crate::键位映射;

const 上古汉语拼音盘面: 盘面定义<'static> =
    盘面![
    [ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ],
    [ 清 來 定 端 透 侯 幽 文 物 隊 _ _ ],
    [ 心 曉 羣 見 溪 支 脂 蒸 職 代 _ _ ],
    [ 精 匣 並 幫 滂 之 微 深 緝 內 ],
    [ 魚 _ 魚 ]
];

const 上古汉语并击布局: 键盘布局 = 键盘布局 {
    盘面: &[基本盘面, 上档盘面, 大写字母盘面, 上古汉语拼音盘面],
    默认盘面: 盘面序号(4),
    默认配列: 键盘配列::正交直列,
};

const 并击键位映射: &[键位映射定义] = &[
    键位映射!(心 => KeyCode::A),
    键位映射!(清 => KeyCode::Q),
    键位映射!(精 => KeyCode::Z),
    键位映射!(曉 => KeyCode::S),
    键位映射!(來 => KeyCode::W),
    键位映射!(匣 => KeyCode::X),
    键位映射!(羣 => KeyCode::D),
    键位映射!(定 => KeyCode::E),
    键位映射!(並 => KeyCode::C),
    键位映射!(見 => KeyCode::F),
    键位映射!(端 => KeyCode::R),
    键位映射!(幫 => KeyCode::V),
    键位映射!(溪 => KeyCode::G),
    键位映射!(透 => KeyCode::T),
    键位映射!(滂 => KeyCode::B),
    键位映射!(魚 => KeyCode::Space),
    键位映射!(支 => KeyCode::H),
    键位映射!(侯 => KeyCode::Y),
    键位映射!(之 => KeyCode::N),
    键位映射!(脂 => KeyCode::J),
    键位映射!(幽 => KeyCode::U),
    键位映射!(微 => KeyCode::M),
    键位映射!(蒸 => KeyCode::K),
    键位映射!(文 => KeyCode::I),
    键位映射!(深 => KeyCode::Comma),
    键位映射!(職 => KeyCode::L),
    键位映射!(物 => KeyCode::O),
    键位映射!(緝 => KeyCode::Dot),
    键位映射!(代 => KeyCode::Semicolon),
    键位映射!(隊 => KeyCode::P),
    键位映射!(內 => KeyCode::Slash),
];

lazy_static! {
    static ref 并击码表示: Box<[拼写运算<'static>]> = Box::new([
        变换!("精匣", "莊"),
        变换!("清來定", "崇"),
        变换!("清來", "初"),
        变换!("心曉羣", "俟"),
        变换!("心曉", "生"),
        变换!("精幫", "章"),
        变换!("清定端", "常"),
        变换!("清端", "昌"),
        变换!("心羣見", "船"),
        变换!("心見", "書"),
        变换!("清定", "從"),
        变换!("心羣", "邪"),
        变换!("並幫", "明"),
        变换!("來定端", "娘"),
        变换!("定端", "泥"),
        变换!("來端", "知"),
        变换!("來透", "徹"),
        变换!("來定", "澄"),
        变换!("曉羣見", "日"),
        变换!("羣見", "疑"),
        变换!("^([魚支侯之脂幽微蒸文深職物緝代隊內])", "影$1"),
        变换!("魚幽職", "藥"),
        变换!("魚幽代", "豹"),
        变换!("魚幽", "宵"),
        变换!("魚文", "元"),
        变换!("魚物", "月"),
        变换!("魚蒸", "陽"),
        变换!("魚微", "歌"),
        变换!("魚職", "鐸"),
        变换!("幽職", "覺"),
        变换!("支職", "錫"),
        变换!("魚深", "談"),
        变换!("侯職", "屋"),
        变换!("支蒸", "耕"),
        变换!("脂職", "質"),
        变换!("脂文", "真"),
        变换!("幽蒸", "終"),
        变换!("支緝", "盍"),
        变换!("侯蒸", "東"),
    ]);
    static ref 并击码键位: Box<[拼写运算<'static>]> = Box::new([
        变换!("莊", "精匣"),
        变换!("崇", "清來定"),
        变换!("初", "清來"),
        变换!("俟", "心曉羣"),
        变换!("生", "心曉"),
        变换!("章", "精幫"),
        变换!("常", "清定端"),
        变换!("昌", "清端"),
        变换!("船", "心羣見"),
        变换!("書", "心見"),
        变换!("從", "清定"),
        变换!("邪", "心羣"),
        变换!("明", "並幫"),
        变换!("娘", "來定端"),
        变换!("泥", "定端"),
        变换!("知", "來端"),
        变换!("徹", "來透"),
        变换!("澄", "來定"),
        变换!("日", "曉羣見"),
        变换!("疑", "羣見"),
        变换!("影", ""),
        变换!("藥", "魚幽職"),
        变换!("豹", "魚幽代"),
        变换!("宵", "魚幽"),
        变换!("元", "魚文"),
        变换!("月", "魚物"),
        变换!("陽", "魚蒸"),
        变换!("歌", "魚微"),
        变换!("鐸", "魚職"),
        变换!("覺", "幽職"),
        变换!("錫", "支職"),
        变换!("談", "魚深"),
        变换!("屋", "侯職"),
        变换!("耕", "支蒸"),
        变换!("質", "脂職"),
        变换!("真", "脂文"),
        变换!("終", "幽蒸"),
        变换!("盍", "支緝"),
        变换!("東", "侯蒸"),
    ]);
}

pub fn 输入方案() -> 输入方案定义<'static> {
    输入方案定义 {
        名称: "上古汉语",
        布局: &上古汉语并击布局,
        指法: 击键方式::并击,
        键位映射: 并击键位映射,
        转写: 转写定义 {
            编码预览: &并击码表示,
            键位提示: &并击码键位,
            输入棱镜: &[],
            词库棱镜: &[],
            拼式验证规则: &[],
        },
    }
}
