use super::練習題;
use crate::gear::caption::字幕格式::詞句;

pub const 上古漢語練習題: &[練習題] = &[練習題 {
    標題: "隰有萇楚 上古漢語 鄭張尚芳擬音",
    編碼: "[邪緝]=<ljɯb> [匣之]=<ɢʷɯʔ> [定陽]=<daŋ> [初魚]=<sŋ̊ʰraʔ> \
           [影歌]=<qral> [泥歌]=<naːl> [羣之]=<ɡɯ> [章支]=<kje> \
           [影宵]=<qrow> [章之]=<tjɯ> [影藥]=<qoːwɢ> [影藥]=<qoːwɢ> \
           [疑豹]=<ŋraːwɢs> [精之]=<ʔslɯʔ> [章之]=<kje> [明魚]=<ma> [端支]=<ʔle> \
           \
           [邪緝]=<ljɯb> [匣之]=<ɢʷɯʔ> [定陽]=<daŋ> [初魚]=<sŋ̊ʰraʔ> \
           [影歌]=<qral> [泥歌]=<naːl> [羣之]=<ɡɯ> [曉魚]=<qʰʷraː> \
           [影宵]=<qrow> [章之]=<tjɯ> [影藥]=<qoːwɢ> [影藥]=<qoːwɢ> \
           [疑豹]=<ŋraːwɢs> [精之]=<ʔslɯʔ> [章之]=<kje> [明魚]=<ma> [見魚]=<kraː> \
           \
           [邪緝]=<ljɯb> [匣之]=<ɢʷɯʔ> [定陽]=<daŋ> [初魚]=<sŋ̊ʰraʔ> \
           [影歌]=<qral> [泥歌]=<naːl> [羣之]=<ɡɯ> [船質]=<ɦliɡ> \
           [影宵]=<qrow> [章之]=<tjɯ> [影藥]=<qoːwɢ> [影藥]=<qoːwɢ> \
           [疑豹]=<ŋraːwɢs> [精之]=<ʔslɯʔ> [章之]=<kje> [明魚]=<ma> [書質]=<hliɡ>",
    字幕: 詞句(
        "隰有萇楚 猗儺其枝 夭之沃沃 樂子之無知 \
         隰有萇楚 猗儺其華 夭之沃沃 樂子之無家 \
         隰有萇楚 猗儺其實 夭之沃沃 樂子之無室",
    ),
}];

pub const 早期中古漢語練習題: &[練習題] = &[練習題 {
    標題: "隰有萇楚 早期中古漢語 《切韻》音系",
    編碼: "[邪深入]=<zip> [云流上]=<ɣiu²> [澄宕]=<ɖiaŋ> [初遇上]=<tʂʰio²> \
           [影止]=<ʔɹie> [泥果]=<nɑ> [羣止]=<ɡiə> [章止]=<tɕie> \
           [影效]=<ʔɹiau> [章止]=<tɕiə> [影通入]=<ʔuk> [影通入]=<ʔuk> \
           [疑效去]=<ŋrau³> [精止上]=<tsiə²> [章止]=<tɕiə> [明遇]=<myo> [知止]=<ʈɹie> \
           \
           [邪深入]=<zip> [云流上]=<ɣiu²> [澄宕]=<ɖiaŋ> [初遇上]=<tʂʰio²> \
           [影止]=<ʔɹie> [泥果]=<nɑ> [羣止]=<ɡiə> [曉假]=<xɹua> \
           [影效]=<ʔɹiau> [章止]=<tɕiə> [影通入]=<ʔuk> [影通入]=<ʔuk> \
           [疑效去]=<ŋrau³> [精止上]=<tsiə²> [章止]=<tɕiə> [明遇]=<myo> [見假]=<kra> \
           \
           [邪深入]=<zip> [云流上]=<ɣiu²> [澄宕]=<ɖiaŋ> [初遇上]=<tʂʰio²> \
           [影止]=<ʔɹie> [泥果]=<nɑ> [羣止]=<ɡiə> [船臻入]=<ʑit> \
           [影效]=<ʔɹiau> [章止]=<ʨiə> [影通入]=<ʔuk> [影通入]=<ʔuk> \
           [疑效去]=<ŋɹau³> [精止上]=<tsiə²> [章止]=<tɕiə> [明遇]=<myo> [書臻入]=<ɕit>",
    字幕: 詞句(
        "隰有萇楚 猗儺其枝 夭之沃沃 樂子之無知 \
         隰有萇楚 猗儺其華 夭之沃沃 樂子之無家 \
         隰有萇楚 猗儺其實 夭之沃沃 樂子之無室",
    ),
}];

pub const 晚期中古漢語練習題: &[練習題] = &[練習題 {
    標題: "隰有萇楚 晚期中古漢語 北宋官話",
    編碼: "[邪深入]=<sip²> [影流上]=<iu³> [牀宕]=<tʃʰiaŋ²> [穿遇上]=<tʂʰy³> \
           [影止]=<i> [泥果]=<nɔ²> [羣止]=<kʰi²> [照止]=<tʂi> \
           [影效]=<iau> [照止]=<tʂi> [影通入]=<uk> [影通入]=<uk> \
           [疑效去]=<ŋiau⁴> [精止上]=<tsi³> [照止]=<tʂi> [明遇]=<myu²> [照止]=<tʃi> \
           \
           [邪深入]=<sip²> [影流上]=<iu³> [牀宕]=<tʃʰiaŋ²> [穿遇上]=<tʂʰy³> \
           [影止]=<i> [泥果]=<nɔ²> [羣止]=<kʰi²> [曉假]=<xua> \
           [影效]=<iau> [照止]=<tʂi> [影通入]=<uk> [影通入]=<uk> \
           [疑效去]=<ŋiau⁴> [精止上]=<tsi³> [照止]=<tʂi> [明遇]=<myu²> [見假]=<kia> \
           \
           [邪深入]=<sip²> [影流上]=<iu³> [牀宕]=<tʃʰiaŋ²> [穿遇上]=<tʂʰy³> \
           [影止]=<i> [泥果]=<nɔ²> [羣止]=<kʰi²> [禪臻入]=<ʂit²> \
           [影效]=<iau> [照止]=<tʂi> [影通入]=<uk> [影通入]=<uk> \
           [疑效去]=<ŋiau⁴> [精止上]=<tsi³> [照止]=<tʂi> [明遇]=<myu²> [審臻入]=<ʂit>",
    字幕: 詞句(
        "隰有萇楚 猗儺其枝 夭之沃沃 樂子之無知 \
         隰有萇楚 猗儺其華 夭之沃沃 樂子之無家 \
         隰有萇楚 猗儺其實 夭之沃沃 樂子之無室",
    ),
}];

pub const 近古漢語練習題: &[練習題] = &[練習題 {
    標題: "隰有萇楚 近古漢語 《中原音韻》音系",
    編碼: "[心齊]=<si²> [影尤]=<iəu³> [穿江]=<tʂʰaŋ²> [穿魚]=<tʂʰu³> \
           [影齊]=<i> [泥歌]=<nɔ²> [溪齊]=<kʰi²> [照支]=<tʂʅ> \
           [影蕭]=<iau> [照支]=<tʂʅ> [影魚]=<u³> [影魚]=<u³> \
           [影蕭]=<iau⁴> [精支]=<tsɿ³> [照支]=<tʂʅ> [微魚]=<ʋu²> [照齊]=<tʂi> \
           \
           [心齊]=<si²> [影尤]=<iəu³> [穿江]=<tʂʰaŋ²> [穿魚]=<tʂʰu³> \
           [影齊]=<i> [泥歌]=<nɔ²> [溪齊]=<kʰi²> [曉家]=<xua> \
           [影蕭]=<iau> [照支]=<tʂʅ> [影魚]=<u³> [影魚]=<u³> \
           [影蕭]=<iau⁴> [精支]=<tsɿ³> [照支]=<tʂʅ> [微魚]=<ʋu²> [見家]=<kia> \
           \
           [心齊]=<si²> [影尤]=<iəu³> [穿江]=<tʂʰaŋ²> [穿魚]=<tʂʰu³> \
           [影齊]=<i> [泥歌]=<nɔ²> [溪齊]=<kʰi²> [審齊]=<ʂi²> \
           [影蕭]=<iau> [照支]=<tʂʅ> [影魚]=<u³> [影魚]=<u³> \
           [影蕭]=<iau⁴> [精支]=<tsɿ³> [照支]=<tʂʅ> [微魚]=<ʋu²> [審齊]=<ʂi³>",
    字幕: 詞句(
        "隰有萇楚 猗儺其枝 夭之沃沃 樂子之無知 \
         隰有萇楚 猗儺其華 夭之沃沃 樂子之無家 \
         隰有萇楚 猗儺其實 夭之沃沃 樂子之無室",
    ),
}];

pub const 現代漢語練習題: &[練習題] = &[練習題 {
    標題: "隰有萇楚 現代漢語 普通話",
    編碼: "[曉齊]=<ɕi²> [影侯齊]=<iəu³> [穿唐]=<tʂʰaŋ²> [穿模]=<tʂʰu³> \
           [影齊]=<i> [泥波合]=<nuo²> [溪齊]=<tɕʰi²> [照支]=<tʂʅ> \
           [影豪齊]=<iau> [照支]=<tʂʅ> [影波合]=<uo⁴> [影波合]=<uo⁴> \
           [影豪齊]=<iau⁴> [精支]=<tsɿ³> [照支]=<tʂʅ> [影模]=<u²> [照支]=<tʂʅ> \
           \
           [曉齊]=<ɕi²> [影侯齊]=<iəu³> [穿唐]=<tʂʰaŋ²> [穿模]=<tʂʰu³> \
           [影齊]=<i> [泥波合]=<nuo²> [溪齊]=<tɕʰi²> [曉麻合]=<xua> \
           [影豪齊]=<iau> [照支]=<tʂʅ> [影波合]=<uo⁴> [影波合]=<uo⁴> \
           [影豪齊]=<iau⁴> [精支]=<tsɿ³> [照支]=<tʂʅ> [影模]=<u²> [見麻齊]=<tɕia> \
           \
           [曉齊]=<ɕi²> [影侯齊]=<iəu³> [穿唐]=<tʂʰaŋ²> [穿模]=<tʂʰu³> \
           [影齊]=<i> [泥波合]=<nuo²> [溪齊]=<tɕʰi²> [審支]=<ʂʅ²> \
           [影豪齊]=<iau> [照支]=<tʂʅ> [影波合]=<uo⁴> [影波合]=<uo⁴> \
           [影豪齊]=<iau⁴> [精支]=<tsɿ³> [照支]=<tʂʅ> [影模]=<u²> [審支]=<ʂʅ⁴>",
    字幕: 詞句(
        "隰有萇楚 猗儺其枝 夭之沃沃 樂子之無知 \
         隰有萇楚 猗儺其華 夭之沃沃 樂子之無家 \
         隰有萇楚 猗儺其實 夭之沃沃 樂子之無室",
    ),
}];
