use super::練習題;
use crate::gear::caption::{
    字幕格式::{段落, 詞句},
    字幕步進::逐字,
};

pub const 注音練習題: &[練習題] = &[
    練習題 {
        標題: "注音符號",
        編碼: "ㄅㄆㄇㄈ ㄉㄊㄋㄌ ㄍㄎㄏ ㄐㄑㄒ ㄓㄔㄕㄖ ㄗㄘㄙ \
               ㄦㄧㄨㄩ ㄚㄛㄜㄝ ㄞㄟㄠㄡ ㄢㄣㄤㄥ ˉˊˇˋ˙",
        字幕: 詞句("ㄅㄆㄇㄈ ㄉㄊㄋㄌ ㄍㄎㄏ ㄐㄑㄒ ㄓㄔㄕㄖ ㄗㄘㄙ \
               ㄦㄧㄨㄩ ㄚㄛㄜㄝ ㄞㄟㄠㄡ ㄢㄣㄤㄥ ˉˊˇˋ˙"),
    },
    練習題 {
        標題: "緣·驚·愧",
        編碼: "ㄧㄡˇ ㄍㄨㄛˋ ㄧˊ ㄇㄧㄢˋ ㄓˉ ㄩㄢˊ \
               ㄉㄤˉ ㄕˊ ㄨㄟˊ ㄓˉ ㄓㄣˋ ㄐㄧㄥˉ \
               ㄓˋ ㄐㄧㄣˉ ㄗˋ ㄎㄨㄟˋ ㄈㄨˊ ㄖㄨˊ",
        字幕: 詞句(
            "有過一面之緣 當時爲之震驚 至今自愧弗如",
        ),
    },
];
